library(tidyverse)
library(REDCapR)


# Загрузка данных ---------------------------------------------------------
data <- readxl::read_xlsx('общая база.xlsx')
data <- data %>% 
  select('ФИО пациента',
         'Пол',
         'Дата.рожд.',
         'Дата установления первичного диагноза МБ',
         'Дата рецидива (не событие)',
         '1-е событие',
         'Код события',
         'Дата события',
         'Исход',
         'Код исхода',
         'Дата исхода') 


# Переименовываем столбцы ---------------------------------------------------------
data <- data %>%
  select('ФИО пациента') %>%
  t(.) %>%
  str_split(., " ",simplify = TRUE) %>%
  data_frame(.) %>%
  mutate("Отчество" = paste(.[,3],.[,4]), "Имя" = .[,1], "Фамилия" = .[,2]) %>%
  select("Имя","Фамилия","Отчество") %>%
  bind_cols(.,data)
data['ФИО пациента'] <- NULL
labels <- c(
  'last_name' = "Фамилия",
  'first_name' = "Имя",
  'middle_name' = "Отчество",
  'sex' = "Пол",
  'birthdate' = "Дата.рожд.",
  'ds_dt' = "Дата установления первичного диагноза МБ",
  'event' = "1-е событие",
  'event_date' = "Дата события",
  'outcome' = "Исход",
  'outcome_date' = "Дата исхода")

data <- data %>% rename(labels)
